driver-tests/bpelse/xsddatatypes/XSDDataTypesJbi/test/MsgTypeToXSDType7/Input.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:ns0="urn:SampleXSD">
  <soapenv:Body>
    <ns0:person name="John">
      <ns0:home country="US">
        <ns0:name>John</ns0:name>
        <ns0:street>123 Street</ns0:street>
        <ns0:city>LA</ns0:city>
        <ns0:state>CA</ns0:state>
        <ns0:zip>12345</ns0:zip>
      </ns0:home>
      <!--Optional:-->
      <ns0:work country="US">
        <ns0:name>Jane</ns0:name>
        <ns0:street>456 Street</ns0:street>
        <ns0:city>NY</ns0:city>
        <ns0:state>NY</ns0:state>
        <ns0:zip>56789</ns0:zip>
      </ns0:work>
    </ns0:person>
  </soapenv:Body>
</soapenv:Envelope>